      *----------------------------------------------------------------*
      * ACCOUNT-REQUEST - Account Inquiry Request Commarea             *
      * Program    : ACCTINQ                                           *
      * Total bytes: 25                                                *
      *----------------------------------------------------------------*
       01  ACCOUNT-REQUEST.
           05  ACCT-NUMBER         PIC X(12).
           05  REQUEST-TYPE        PIC X(2).
           05  REQUEST-DATE        PIC X(8).
           05  FILLER              PIC X(3).
