      *----------------------------------------------------------------*
      * POLCYINQ-REQUEST - Insurance Policy Inquiry Request Commarea  *
      * Program    : POLCYINQ                                         *
      * Total bytes: 30                                               *
      *----------------------------------------------------------------*
       01  POLCYINQ-REQUEST.
           05  POLICY-ID          PIC X(15).
           05  REQUEST-DATE       PIC X(8).
           05  FILLER             PIC X(7).
